<a href="https://colab.research.google.com/github/siddhp4/Assignment-1-Q23-Basic-Statistics-Level-1-/blob/main/Recommendation_Engine.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

In [1]:
import pandas as pd
import numpy as np

In [2]:
movies_df = pd.read_csv('Movie.csv')

In [4]:
movies_df

      userId             movie  rating
0          3  Toy Story (1995)     4.0
1          6  Toy Story (1995)     5.0
2          8  Toy Story (1995)     4.0
3         10  Toy Story (1995)     4.0
4         11  Toy Story (1995)     4.5
...      ...               ...     ...
8987    7087  GoldenEye (1995)     3.0
8988    7088  GoldenEye (1995)     1.0
8989    7105  GoldenEye (1995)     2.0
8990    7113  GoldenEye (1995)     3.0
8991    7117  GoldenEye (1995)     3.0

[8992 rows x 3 columns]

In [5]:
movies_df.sort_values('userId')

      userId                    movie  rating
2569       1           Jumanji (1995)     3.5
3724       2  Grumpier Old Men (1995)     4.0
0          3         Toy Story (1995)     4.0
5204       4              Heat (1995)     3.0
7444       4         GoldenEye (1995)     4.0
...      ...                      ...     ...
6463    7117              Heat (1995)     5.0
2567    7119         Toy Story (1995)     5.0
2568    7120         Toy Story (1995)     4.5
3723    7120           Jumanji (1995)     4.0
7163    7120           Sabrina (1995)     4.0

[8992 rows x 3 columns]

In [6]:
#number of unique users in the dataset
len(movies_df.userId.unique())

4081

In [7]:
movies_df['rating'].value_counts()

3.0    2736
4.0    2660
5.0    1394
3.5     679
2.0     542
4.5     374
2.5     277
1.0     212
1.5      61
0.5      57
Name: rating, dtype: int64

In [8]:
len(movies_df.movie.unique())

10

In [9]:
movies_df.movie.value_counts()

Toy Story (1995)                      2569
GoldenEye (1995)                      1548
Heat (1995)                           1260
Jumanji (1995)                        1155
Sabrina (1995)                         700
Grumpier Old Men (1995)                685
Father of the Bride Part II (1995)     657
Sudden Death (1995)                    202
Waiting to Exhale (1995)               138
Tom and Huck (1995)                     78
Name: movie, dtype: int64

In [10]:
user_movies_df = movies_df.pivot(index='userId',
                                 columns='movie',
                                 values='rating')

In [11]:
user_movies_df

movie   Father of the Bride Part II (1995)  ...  Waiting to Exhale (1995)
userId                                      ...
1                                      NaN  ...                       NaN
2                                      NaN  ...                       NaN
3                                      NaN  ...                       NaN
4                                      NaN  ...                       NaN
5                                      NaN  ...                       NaN
...                                    ...  ...                       ...
7115                                   4.0  ...                       NaN
7116                                   3.5  ...                       NaN
7117                                   NaN  ...                       NaN
7119                                   NaN  ...                       NaN
7120                                   NaN  ...                       NaN

[4081 rows x 10 columns]

In [12]:
user_movies_df.index = movies_df.userId.unique()

In [13]:
user_movies_df

movie  Father of the Bride Part II (1995)  ...  Waiting to Exhale (1995)
3                                     NaN  ...                       NaN
6                                     NaN  ...                       NaN
8                                     NaN  ...                       NaN
10                                    NaN  ...                       NaN
11                                    NaN  ...                       NaN
...                                   ...  ...                       ...
7044                                  4.0  ...                       NaN
7070                                  3.5  ...                       NaN
7080                                  NaN  ...                       NaN
7087                                  NaN  ...                       NaN
7105                                  NaN  ...                       NaN

[4081 rows x 10 columns]

In [14]:
#Impute those NaNs with 0 values
user_movies_df.fillna(0, inplace=True)

In [15]:
user_movies_df

movie  Father of the Bride Part II (1995)  ...  Waiting to Exhale (1995)
3                                     0.0  ...                       0.0
6                                     0.0  ...                       0.0
8                                     0.0  ...                       0.0
10                                    0.0  ...                       0.0
11                                    0.0  ...                       0.0
...                                   ...  ...                       ...
7044                                  4.0  ...                       0.0
7070                                  3.5  ...                       0.0
7080                                  0.0  ...                       0.0
7087                                  0.0  ...                       0.0
7105                                  0.0  ...                       0.0

[4081 rows x 10 columns]

In [16]:
#Calculating Cosine Similarity between Users
from sklearn.metrics import pairwise_distances
from scipy.spatial.distance import cosine, correlation

In [17]:

user_sim = 1 - pairwise_distances( user_movies_df.values,metric='cosine')

In [18]:
user_sim

array([[1.        , 0.        , 0.        , ..., 0.        , 0.        ,
        0.55337157],
       [0.        , 1.        , 0.        , ..., 0.45883147, 0.        ,
        0.        ],
       [0.        , 0.        , 1.        , ..., 0.45883147, 1.        ,
        0.62254302],
       ...,
       [0.        , 0.45883147, 0.45883147, ..., 1.        , 0.45883147,
        0.47607054],
       [0.        , 0.        , 1.        , ..., 0.45883147, 1.        ,
        0.62254302],
       [0.55337157, 0.        , 0.62254302, ..., 0.47607054, 0.62254302,
        1.        ]])

In [19]:
#Store the results in a dataframe
user_sim_df = pd.DataFrame(user_sim)

In [20]:
#Set the index and column names to user ids 
user_sim_df.index = movies_df.userId.unique()
user_sim_df.columns = movies_df.userId.unique()

In [21]:
user_sim_df.iloc[0:5, 0:5]

     3    6    8    10   11
3   1.0  0.0  0.0  0.0  1.0
6   0.0  1.0  0.0  0.0  0.0
8   0.0  0.0  1.0  0.0  0.0
10  0.0  0.0  0.0  1.0  0.0
11  1.0  0.0  0.0  0.0  1.0

In [22]:
np.fill_diagonal(user_sim, 0)
user_sim_df.iloc[0:5, 0:5]

     3    6    8    10   11
3   0.0  0.0  0.0  0.0  1.0
6   0.0  0.0  0.0  0.0  0.0
8   0.0  0.0  0.0  0.0  0.0
10  0.0  0.0  0.0  0.0  0.0
11  1.0  0.0  0.0  0.0  0.0

In [23]:
#Most Similar Users
user_sim_df.idxmax(axis=1)[0:5]

3       11
6      168
8       16
10    4047
11       3
dtype: int64

In [24]:
movies_df[(movies_df['userId']==6) | (movies_df['userId']==168)]

      userId                    movie  rating
1          6         Toy Story (1995)     5.0
60       168         Toy Story (1995)     4.5
3725       6  Grumpier Old Men (1995)     3.0
6464       6           Sabrina (1995)     5.0

In [25]:
user_1=movies_df[movies_df['userId']==6]

In [26]:
user_2=movies_df[movies_df['userId']==168]

In [27]:
user_2.movie

60    Toy Story (1995)
Name: movie, dtype: object

In [28]:

user_1.movie

1              Toy Story (1995)
3725    Grumpier Old Men (1995)
6464             Sabrina (1995)
Name: movie, dtype: object

In [29]:
pd.merge(user_1,user_2,on='movie',how='outer')

   userId_x                    movie  rating_x  userId_y  rating_y
0         6         Toy Story (1995)       5.0     168.0       4.5
1         6  Grumpier Old Men (1995)       3.0       NaN       NaN
2         6           Sabrina (1995)       5.0       NaN       NaN